# pandas library 

Data Inspection

In [6]:
import pandas as pd


df=pd.read_excel(r"D:\Gradtwin\Gradtwin-Works\demo.xlsx")
df.head(2)     #default agrument 5

       Name  Age Gender   GPA Domain
0  Srikanth   21      M  9.24     AI
1    Surya    20      M  9.55     AI

In [59]:
df.tail(2)

      name  age  cgpa
3  Sharan    25  9.45
4     Bala   24  8.75

In [61]:
df.sample()

     name  age  cgpa
1  Surya    20   9.8

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   cgpa    5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

In [5]:
df.describe(include='all')  #describe the statistical inference of the given dataframe

            Name        Age Gender      Marks
count         10  10.000000     10  10.000000
unique        10        NaN      2        NaN
top     Srikanth        NaN      M        NaN
freq           1        NaN      5        NaN
mean         NaN  27.500000    NaN  67.800000
std          NaN   5.212165    NaN  29.161619
min          NaN  20.000000    NaN  27.000000
25%          NaN  22.750000    NaN  40.000000
50%          NaN  29.500000    NaN  76.000000
75%          NaN  30.750000    NaN  93.000000
max          NaN  34.000000    NaN  98.000000

In [64]:
print(df.to_records())

[(0, 'Srikanth', 21, 9.1 ) (1, 'Surya ', 20, 9.8 ) (2, 'Navin', 20, 9.7 )
 (3, 'Sharan ', 25, 9.45) (4, 'Bala', 24, 8.75)]

In [65]:
df.describe(include='object')

            name
count          5
unique         5
top     Srikanth
freq           1

In [3]:
df.shape   #property or attribute of the df class
df.isnull()

    Name    Age  Gender  Marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False
3  False  False   False  False
4  False  False   False  False
5  False  False   False  False
6  False  False   False  False
7  False  False   False  False
8  False  False   False  False
9  False  False   False  False

# Insights from DEMO data

In [81]:
import pandas as pd
import matplotlib

df=pd.read_excel(r"D:\Gradtwin\Gradtwin-Works\demo.xlsx")

In [14]:
df.describe(include='all')

            Name        Age Gender       GPA Domain
count         10  10.000000     10  10.00000     10
unique        10        NaN      2       NaN      2
top     Srikanth        NaN      M       NaN     AI
freq           1        NaN      5       NaN      5
mean         NaN  27.500000    NaN   8.54300    NaN
std          NaN   5.212165    NaN   1.11465    NaN
min          NaN  20.000000    NaN   6.66000    NaN
25%          NaN  22.750000    NaN   7.58500    NaN
50%          NaN  29.500000    NaN   9.11500    NaN
75%          NaN  30.750000    NaN   9.46750    NaN
max          NaN  34.000000    NaN   9.65000    NaN

In [20]:
df.describe(include="object")

            Name Gender Domain
count         10     10     10
unique        10      2      2
top     Srikanth      M     AI
freq           1      5      5

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   Gender  10 non-null     object
 3   GPA     10 non-null     float64
 4   Domain  10 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 532.0+ bytes

In [26]:
print(f"Top 2 rows")
df.head(2)

Top 2 rows

       Name  Age Gender   GPA Domain
0  Srikanth   21      M  9.24     AI
1    Surya    20      M  9.55     AI

In [27]:
print("Bottom 3 rows")
df.tail(3)

Bottom 3 rows

    Name  Age Gender   GPA Domain
7  Vicky   20      M  9.65     CS
8   Sita   30      F  9.25     AI
9   Banu   34      F  8.99     CS

In [33]:
df.sum(numeric_only=True)

Age    275.00
GPA     85.43
dtype: float64

In [85]:
print(f"""
        Total number of the students is {10}
        The average GPA obtained by the students is {8.54}
        Maximum GPA is {9.6} and Minimum GPA is {6.66}
        Average Student ages are differed by ~{5} yrs
        Total Sum of GPA is {85.4}
        There are {2} Domains [AI and CS]
        Memory used by the Student Database is {532} Bytes""")

        Total number of the students is 10
        The average GPA obtained by the students is 8.54
        Maximum GPA is 9.6 and Minimum GPA is 6.66
        Average Student ages are differed by ~5 yrs
        Total Sum of GPA is 85.4
        There are 2 Domains [AI and CS]
        Memory used by the Student Database is 532 Bytes